#pragma once


/////////////////////////////////////////////////////////////////         --          --     
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//     --     -      -     -- 
//+                                                           +//     --      -   -       -- 
//+							结构体			                  +//      --       -        --  
//+                                                           +//       -     sudami     -   
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//        --            --    
/////////////////////////////////////////////////////////////////          --        --  
//                                                                           --    --
//		    																	--


typedef struct _IOCTL_CREATEDIRORLINK_BUFFER_ // size - 0x24
{
	ULONG Reserved ;

	LPWSTR lpcFullPath ; // lpc的全路径
	ULONG lpcFullPathLength ;

	BOOL bFlag ; // 标记是否使用到下面的2个内容
	LPWSTR lpcFatherPath ; // lpc的父路径
	ULONG lpcFatherPathLength ;

} IOCTL_CREATEDIRORLINK_BUFFER, *LPIOCTL_CREATEDIRORLINK_BUFFER ;

/////////////////////////////////////////////////////////////////         --          --     
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//     --     -      -     -- 
//+                                                           +//     --      -   -       -- 
//+                         函数预定义                        +//      --       -        --  
//+                                                           +//       -     sudami     -   
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//        --            --    
/////////////////////////////////////////////////////////////////          --        --  
//                                                                           --    --
//		    																	--

NTSTATUS
Ioctl_CreateDirOrLink (
	IN PVOID pNode, 
	IN PVOID pInBuffer
	);



///////////////////////////////   END OF FILE   ///////////////////////////////