#pragma once


/////////////////////////////////////////////////////////////////         --          --     
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//     --     -      -     -- 
//+                                                           +//     --      -   -       -- 
//+							结构体			                  +//      --       -        --  
//+                                                           +//       -     sudami     -   
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//        --            --    
/////////////////////////////////////////////////////////////////          --        --  
//                                                                           --    --
//		    																	--


typedef enum _IOCTL_ENUMBOXS_FLAG_
{
	_IOCTL_ENUMBOXS_FLAG_GetSandboxsCounts_  = 3,
	_IOCTL_ENUMBOXS_FLAG_GetSandboxsCurName_ = 5,

} IOCTL_ENUMBOXS_FLAG ;


typedef struct _IOCTL_ENUMBOXS_BUFFER_ // size - 0x24
{
/*0x000 */ int Flag ; // 3 - 第一次通信,告诉R3沙箱个数; 5 - 再次通信,找到@CurrentIndex对应的节点,拷贝沙箱名
/*0x004 */ 
		union
		{
			int CurrentIndex ; // 指定当前要获取的节点编号;
			int* SandboxsCounts ; // [OUT] 存放沙箱的个数
		} u ;

/*0x008 */ PVOID lpData ; // [OUT] R3缓冲区,用来存放获取到的沙箱名[ Length <= MAX_PATH ]
/*0x00C */ int INDataLength ; // R3缓冲区大小

} IOCTL_ENUMBOXS_BUFFER, *LPIOCTL_ENUMBOXS_BUFFER ;


/////////////////////////////////////////////////////////////////         --          --     
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//     --     -      -     -- 
//+                                                           +//     --      -   -       -- 
//+                         函数预定义                        +//      --       -        --  
//+                                                           +//       -     sudami     -   
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//        --            --    
/////////////////////////////////////////////////////////////////          --        --  
//                                                                           --    --
//		    																	--

NTSTATUS
Ioctl_EnumBoxes (
	IN PVOID pNode, 
	IN PVOID pInBuffer
	);


///////////////////////////////   END OF FILE   ///////////////////////////////